[
{"article_id": 1, "title": "Ottawa offers rent relief for businesses as some provinces prepare to reopen economies", "author": "Kathleen Harris", "url": "https://www.cbc.ca/news/politics/rent-relief-covid-trudeau-1.5543558?cmp=rss", "summary": "The rent relief plan, to be funded jointly with the provinces, will provide non-repayable loans to commercial property owners to cover 50 per cent of rent payments for April, May and June. \"We recognize that COVID-19 is hitting some people harder than others, some areas harder than others, and unfortunately this is something we are grappling with,\" he said. \"What those actually are, what that will look like, will be up to the provinces and local jurisdictions to determine,\" he said. Gord Johns, the party's critic for small business and tourism, said any delay in getting help to more of them could \"spell disaster.\" \"We are failing our parents, our grandparents, our elders, the greatest generation who built this country. Today, he said the federal government is \"very close\" to an agreement with the provinces and territories on that issue. Watch: Trudeau discusses new rent subsidy program The government also is offering a $40,000 government-backed loan to businesses, $10,000 of which can be non-repayable.", "article_type": "politics"},
{"article_id": 2, "title": "Trudeau is talking about more gun control — but he hasn't enacted the last round of firearms changes", "author": "John Paul Tasker", "url": "https://www.cbc.ca/news/politics/trudeau-gun-control-c71-not-enacted-1.5543032?cmp=rss", "summary": "\"We're getting more and more worried that the opposition has, again, started seeping into the Liberal Party through this very active, politically engaged gun lobby,\" she said. Rod Giltaca, executive director of the Canadian Coalition of Firearm Rights, said C-71 demands \"substantial infrastructure,\" which could explain the delay. But while Trudeau has promised to press ahead with a ban on \"assault-style weapons,\" the more modest gun control measures promised in the government's first term are gathering dust. While it might promise gun control at election time, the current Liberal government has a poor record of actually following through, she said. Thus, the implied connection is purely political,\" he said. She said the year-long delay in implementing C-71's provisions shows that gun control \"simply isn't a priority\" for the government. The legislation in question, then known as Bill C-71, made consequential amendments to the firearms regime and was passed into law in May 2019.", "article_type": "politics"},
{"article_id": 3, "title": "Expectant mothers to get financial help following omission: Qualtrough", "author": "Jordan Press", "url": "https://www.cbc.ca/news/politics/expectant-mothers-get-financial-help-1.5544155?cmp=rss", "summary": "Revenues were up $8 billion, or 2.7 per cent, largely reflecting an increase in personal income taxes, the report said. Net federal debt surpassed $780 billion, the fiscal monitor said. Federal figures posted Friday reveal $22.4 billion has been paid out through the $2,000-a-month benefit. Direct spending on aid to hard-hit workers and businesses has deepened the federal deficit for this fiscal year, and added to the national debt. Many are still waiting for their first benefit payment, and are worried they won't work enough hours to qualify for EI maternity and parental benefits. Employment Minister Carla Qualtrough said Friday there is a fix coming to make sure no one is disadvantaged. \"They will get what they are entitled to ... because there is not a scenario where we don't make this right for people.\"", "article_type": "politics"},
{"article_id": 4, "title": "GM Canada to start producing a million face masks per month at Oshawa, Ont., plant", "author": "No Author Listed", "url": "https://www.cbc.ca/news/business/gm-canada-masks-1.5544058?cmp=rss", "summary": "In an emailed statement to CBC News, Bains said, \"We are rising to the challenge, supporting our hard-working front line and essential workers, and keeping Canadians safe.\" General Motors of Canada Ltd. is going to start producing up to a million face masks per month at its facility in Oshawa, Ont., the company said Friday. \"Unifor members in Oshawa are highly skilled and proud to step up and make whatever our country needs to get through this pandemic,\" Unifor president Jerry Dias said in a release. Innovation, Science and Industry Minister Navdeep Bains gave the company and the entire automotive sector kudos for \"stepping up in a big way to retool in the fight against COVID-19.\" GM Canada's biggest union, Unifor, has already signed off on the plan.", "article_type": "politics"},
{"article_id": 5, "title": "Small businesses fear banks are freezing them out of a government-backed pandemic loan program", "author": "Ashley Burke", "url": "https://www.cbc.ca/news/politics/pandemic-coronavirus-covid-small-business-loans-1.5543318?cmp=rss", "summary": "\"With the EDC program, businesses are required to qualify for the loan and must meet their bank's adjudication criteria,\" said a BMO spokesperson in a statement. \"Our understanding from the ground is that the speed and the efficiency of the relationship between small businesses and their banking institutions, that's going well,\" Duclos said. \"Obviously, I was very disappointed, but then I talked to my EDC representative and they were just as surprised as I was,\" he said. BMO said this program is intended to provide businesses with \"additional short-term liquidity support, where needed, after other relief measures have been explored.\" \"I kind of understand that, but at the same time, we're hurting as a business and so are many other small businesses.\" \"This is wrong,\" said François Bruneau, president of DFC Woodworks. If a loan doesn't qualify under regular conditions, it won't qualify now, he said.", "article_type": "politics"},
{"article_id": 6, "title": "How focusing on the age of pandemic victims could blind us to the bigger picture", "author": "Éric Grenier", "url": "https://www.cbc.ca/news/politics/covid19-elderly-deaths-1.5542967?cmp=rss", "summary": "Asked at a press briefing when and how the economy can be opened up again, he replied that \"even when we open up … sadly and unfortunately, people will still be dying.\" (At this point, however, we still don't know if people who have recovered from COVID-19 are immune to re-infection.) Every day we see 30, 40, 50 people passing away. … It hits you hard in the heart, believe me,\" he said. In general, the life expectancy of someone who already has reached old age is longer than one might think — and it continues to stretch out the longer someone lives. Ontario Premier Doug Ford, whose mother-in-law has tested positive for COVID-19, made this point on Tuesday. Despite that sobering number, provinces are beginning to think about how they might get people back to work and provide them with a greater sense of normalcy.", "article_type": "politics"},
{"article_id": 7, "title": "By the numbers: Federal projected spending on direct supports due to COVID-19 hits $145B", "author": "Karina Roman", "url": "https://www.cbc.ca/news/politics/covid-19-economic-programs-1.5543092?cmp=rss", "summary": "The Canada emergency business account, or CEBA, makes available, through banks, interest-free loans of $40,000 to qualifying businesses. For example, a large portion, $300 billion, is a measure by the Office of the Superintendent of Financial Institutions (OFSI) to free up capital for the banks. The government also announced grants for student volunteers and $291 million to extend expiring federal graduate research scholarships and post-doctoral fellowships, as well as interest-free student loan deferrals. The government has received more than nine million applications as of April 21, resulting in $21.3 billion in payments so far — so the price tag here may rise. The fastest program out the door is the Canada emergency relief benefit, or CERB, which has temporarily absorbed most Employment Insurance claims as well. The federal government's latest projection of how much it will spend on direct support for Canadians to get through the COVID-19 crisis has now reached more than $145.6 billion. It's the additional emergency funding and the direct support measures that will have the biggest impact on the deficit and debt in the government's financial books.", "article_type": "politics"},
{"article_id": 8, "title": "WHO set pandemic response back by 2-3 weeks, says doctor on new federal task force", "author": "Peter Zimonjic", "url": "https://www.cbc.ca/news/politics/naylor-china-who-data-trust-1.5543281?cmp=rss", "summary": "\"I think that one thing that we missed out on was figuring out how to protect some of these vulnerable populations, that's a miss,\" Naylor said. So, engage, scrutinize, hold accountable … and make better.\" \"I think we lost two to three weeks and I think that's regrettable, and I think that will come to light when a review is done.\" \"I don't think this was a massive amount of time lost,\" he said. Other doctors on the task force include Dr. Catherine Hankins, Dr. Tim Evans, Dr. Theresa Tam and Dr. Mona Nemer. It's unacceptable, as the prime minister said.\" They knew from SARS-1 that there had been problems with incomplete reporting,\" Dr. David Naylor told CBC News Network's Power & Politics Thursday.", "article_type": "politics"},
{"article_id": 9, "title": "Conservatives blast MP who asked whether top pandemic doctor 'works for China' as Scheer steers clear", "author": "Kathleen Harris", "url": "https://www.cbc.ca/news/politics/sloan-tam-china-coronavirus-pandemic-1.5542497?cmp=rss", "summary": "The UN, the WHO, and Chinese Communist propaganda must never again have a say over Canada's public health!<a href=\"https://twitter.com/hashtag/cdnpoli?src=hash&amp;ref_src=twsrc%5Etfw\">#cdnpoli</a><a href=\"https://t.co/2u1JxCAdIV\">https://t.co/2u1JxCAdIV</a> \"Does [Tam] work for Canada or for China?\" His remarks drew swift condemnation on social media, with some calling his words \"repugnant,\" \"vile\" and \"xenophobic.\" \"I'm a pretty focused person and I work really, really hard,\" Tam said, adding that she has been working more than 20 hours a day. That's up for them to explain, and ultimately the members of our party will decide when they vote in a leadership race,\" he said. Dr. Theresa Tam, Canada’s Chief Public Health Officer, has failed Canadians.<br><br>Dr. \"We need to continue in our resolve to be an open, welcoming, respectful country and I think all Canadians expect that of every politician.\" Tam, who was born in British Hong Kong and grew up in the U.K., has denounced the rise in anti-Asian racist incidents in Canada since the novel coronavirus erupted in Wuhan, China.", "article_type": "politics"},
{"article_id": 10, "title": "Provinces will decide when to reopen their economies, Trudeau says", "author": "Peter Zimonjic", "url": "https://www.cbc.ca/news/politics/time-to-reopen-economy-1.5543191?cmp=rss", "summary": "Watch: Tam questioned on what benchmarks will allow the economy to reopen: \"It is so essential that we, not too prematurely, lift restrictions currently in place,\" she said. Beginning May 4, restrictions on certain medical practices in Saskatchewan, such as dentistry, optometry and chiropractic therapy, will be lifted along with restrictions on fishing and boating. Read more: <a href=\"https://t.co/BBiJlsE8qC\">https://t.co/BBiJlsE8qC</a> <a href=\"https://t.co/AVQA6ACUH2\">pic.twitter.com/AVQA6ACUH2</a> \"We are going to work to coordinate so that we're basing ourselves on shared values, principles and scientific approaches right across the country,\" Trudeau said. <a href=\"https://twitter.com/PremierScottMoe?ref_src=twsrc%5Etfw\">@PremierScottMoe</a> presented a five-phase plan to reopen his province beginning May 4. Deputy Prime Minister Chrystia Freeland said that, regardless of when individual provinces begin to open up again, the process must be informed by science. “We have to find the middle ground that continues to keep our case numbers low... while at the same time allowing for businesses to reopen,” he said.", "article_type": "politics"},
{"article_id": 11, "title": "Concerns about low uptake, flawed pandemic data linger as provinces pursue digital contact tracing", "author": "Catharine Tunney", "url": "https://www.cbc.ca/news/politics/contact-tracing-app-provinces-1.5538541?cmp=rss", "summary": "\"Some people are just not that tech-savvy and downloading an app, setting it up, adopting whatever, it's not going to appeal to them. \"At the same time, of course, every day that goes by that we don't collect [this] information on the phones is potentially lives that we're not saving.\" At least two provinces — Ontario and British Columbia — are pursuing vendors for their own apps, said the source, while other provinces are evaluating their own solutions. Whenever you're running into a person, you will exchange anonymized Bluetooth keys and then you will know you were close to a person,\" he said. And in order to do that, we need to address the core issue of privacy,\" he said during a media briefing on Thursday. Many people don't have cell phones, including some of the people who are at most high risk for COVID-19 ... the elderly demographic,\" she added. So far, she said, the literature has suggested a contact tracing system needs a participation rate of about 60 per cent to be effective.", "article_type": "politics"},
{"article_id": 12, "title": "Free online 'threat blocker' launched in Canada as successful COVID-19 scams multiply", "author": "Catharine Tunney", "url": "https://www.cbc.ca/news/politics/free-cyber-blocker-cse-1.5542888?cmp=rss", "summary": "\"Not necessarily a rise in activity, but certainly a switch to the use of COVID-related themes as lures, which are very enticing for Canadians,\" said Jones. \"The CIRA cyber shield is a new public initiative, so it certainly deserves scrutiny,\" he said. \"Basically, anything we're using to defend the government of Canada we're now making available for all Canadians, so that they can protect themselves.\" \"I don't think that it's likely that the cyber centre is, you know, going to secretly use this to build a censorship networking path. Any state-sponsored type activity as well that we can block, we're putting it in there,\" he said. As the Canadian operator of the threat-blocker, CIRA would have to comply with Canadian privacy laws, including the Personal Information Protection and Electronic Documents Act. \"If the Canadian Shield system functions properly, it could make a significant contribution to internet security while at the same time protecting privacy.\"", "article_type": "politics"},
{"article_id": 13, "title": "Cities ask Liberals for up to $15B in emergency funding to stave off COVID-19 budget crisis", "author": "No Author Listed", "url": "https://www.cbc.ca/news/canada/edmonton/emergency-funding-needed-by-canadian-cities-federation-of-canadian-municipalities-1.5542697?cmp=rss", "summary": "\"They've delivered urgent aid to individuals, to business, and most recently to students, and that's very positive,\" Iveson told reporters on a videoconference. As of Tuesday, the government had spent $21.3 billion on the Canada Emergency Response Benefit, a $2,000-a-month benefit to workers. Adding to issues is that some municipal councils are considering, or have already approved, delays in collecting property taxes to give residents a financial break. In response, the federal government has given money to provinces to cover health-care costs and targeted help for the oil and gas sector. Smaller provinces will \"see severe contractions\" but fare slightly better than Ontario and Quebec, the report said. Absent federal help, the federation says local councils could be forced to cut spending further or approve large tax increases. Transit ridership and parking revenue is down as people stay home due to the pandemic, while recreation centres and arenas that would normally be bustling also remain closed.", "article_type": "politics"},
{"article_id": 14, "title": "Trudeau announces $1.1B scientific strategy to fight COVID-19", "author": "Kathleen Harris", "url": "https://www.cbc.ca/news/politics/trudeau-science-1.5542294?cmp=rss", "summary": "\"The better we understand this virus, its spread and its impact on different people, the better we can fight it and eventually defeat it,\" Trudeau said today. \"Testing must increase even further before we can reopen and restart our normal activities as a country,\" he said. David Naylor, who chaired the committee that reviewed Canada's response to SARS in 2003, will be on the panel. There are discussions around treatments for COVID-19 that might work as well as a vaccine,\" he said. That's why it's important to establish the capacity to mass-produce vaccines here in Canada now, he said. And this is important in guiding our recovery strategies,\" she said. Around the world, many people are losing patience with public health guidelines that compel them to stay at home and practise physical distancing.", "article_type": "politics"},
{"article_id": 15, "title": "An ill wind: The pandemic is giving states political cover for controversial acts", "author": "Evan Dyer", "url": "https://www.cbc.ca/news/politics/pandemic-covid-coronavirus-china-hungary-bolivia-texas-israel-turkmenistan-1.5541548?cmp=rss", "summary": "On Saturday, he made his move, arresting 15 major pro-democracy figures — including Martin Lee, the former colony's octogenarian \"father of democracy.\" Prime Minister Justin Trudeau's attempt to run Canada without having to consult with Parliament until the end of 2021 was condemned as a \"power grab\" by opposition parties, constitutional scholars, historians and non-partisan watchdogs. \"I don't know what 'all sides' means,\" said Ong, who believes that Xi Jinping's autocratic regime has been winning back its people's trust after a rocky January and February. \"After a state of emergency is announced, everyone must be careful about social media misinformation,\" Prayuth warned the Thai people in a television announcement. \"We only have to win once, but win properly,\" he said at the time. And it might have been — but with COVID-19, Israel's courts were closed on March 15, two days before his trial was due to start. Canada's embrace of the new president of Bolivia, Jeanine Añez, was lukewarm and predicated upon a quick rerun of the election.", "article_type": "politics"},
{"article_id": 16, "title": "Why ending Quebec's COVID-19 lockdown could mean freedom for some, but not all", "author": "Jonathan Montpetit", "url": "https://www.cbc.ca/news/canada/montreal/ethical-dilemma-as-quebec-eases-covid-19-lockdown-1.5540549?cmp=rss", "summary": "However, he said, that doesn't mean we ought to throw up our hands and say, as some existentialists might, that choice is arbitrary. \"Young people who could get the disease with almost no symptoms are like being vaccinated,\" Quebec's public health director, Horacio Arruda, said last week. He wasn't ready to provide specifics, but along with Dr. Horacio Arruda, the provincial public health director, Legault did offer some hints of what gradually reopening society will entail. On the other, there are the social, psychological, economic and moral costs of continued confinement. Maclure, who helped draft a government guide to the ethical problems raised by the pandemic, points to Quebec's welfare net as one way of making the trade-offs more palatable. \"The ethical problem here is one that has to do with fairness,\" said Prof. Jocelyn Maclure, a philosopher at Université Laval in Quebec City. \"Whatever we decide, there will be a significant ethical cost,\" Maclure said in a recent interview.", "article_type": "politics"},
{"article_id": 17, "title": "Government has helped bring home 20,000 Canadians — but many are still stranded abroad by the pandemic", "author": "Kathleen Harris", "url": "https://www.cbc.ca/news/politics/stranded-canadians-abroad-foreign-affairs-1.5541682?cmp=rss", "summary": "The government had closed all transit between islands, among islands, so we had to get special permission to get Philippine Airlines to pick them up,\" Oliphant said. \"We understand the logistical nightmare it is to make several stops in the country, but Colombia has cooperated with Canada,\" Garay said. \"We're getting there, but the last part is tough,\" he said. He said he is personally aware of about 217 Canadians who want to leave Colombia and about 200 Colombians in Canada, mostly students, who want to go home. At 87 years old, he said, his mother is too frail to make the eight-hour drive from Medellin to the airport in Bogota. He suggested a \"two-way initiative\" which could see flights returning Canadians home from Colombia, making several regional stops and then taking Colombians home from Canada. The partnering countries are engaging in \"seat swapping,\" where one country offers seats on one flight in exchange for seats on another.", "article_type": "politics"},
{"article_id": 18, "title": "Trudeau announces $9B in financial support for students; critics say pandemic aid must flow faster", "author": "Kathleen Harris", "url": "https://www.cbc.ca/news/politics/trudeau-students-financial-aid-1.5540814?cmp=rss", "summary": "\"We're hoping students will find ways to keep themselves occupied, to contribute, to upskill and just to not stay sitting around for the whole entire summer,\" she said. Raquel Dancho, Conservative critic for diversity, inclusion and youth, said Conservatives welcome the new support for students but said it's taken too long. \"New Democrats are glad the government is finally turning its focus to help students, but another complicated system is not what students need and it comes weeks late. The prime minister also announced the federal government is doubling student grants for eligible students — up to $6,000 for full-time students and up to $3,600 for part-time students. \"We've been quite creative working with provinces and youth organizations, coming up with ideas, and that's why we're bolstering the number of employment opportunities.\" Employment Minister Carla Qualtrough said the government recognizes it's going to be a tough summer for students, given their limited employment options. We need innovative ways to get our students to work safely, and to support essential service industries facing labour shortages in our communities.\"", "article_type": "politics"},
{"article_id": 19, "title": "Canada extends ban on arms sales to NATO ally Turkey", "author": "Murray Brewster", "url": "https://www.cbc.ca/news/politics/turkey-canada-arms-sales-nato-1.5541714?cmp=rss", "summary": "Several other countries — including France, Sweden, the Czech Republic, Norway, the Netherlands, Finland, Spain and Germany — have imposed an arms embargo on Turkey. The items in question include ammunition, light weapons, armour, protective equipment and electronics. Charles-Marie Matte, deputy director of the export controls division at Global Affairs, said in an email that approvals have been suspended \"until further notice.\" \"Exceptional circumstances\" related to Canada's international alliance commitments might see the government consider issuing a permit, the notice said. U.S. defence contractor Raytheon, which has a branch in Canada, manufactures the Patriot missile system. An example might be the export of components for \"a NATO missile defence system,\" Matte said in an email. Turkey is on a Canadian government list of \"trusted\" countries where Canadian defence contractors can safely do business and sell sophisticated, restricted weapons.", "article_type": "politics"},
{"article_id": 20, "title": "Inside Canada's frayed pandemic early warning system and its COVID-19 response", "author": "Murray Brewster", "url": "https://www.cbc.ca/news/politics/covid19-pandemic-early-warning-1.5537925?cmp=rss", "summary": "\"From the start of the COVID-19 outbreak, GPHIN was, and continues to be, an important source of public health intelligence for PHAC,\" said Natalie Mohamed in an email. But to date, he said, he's seen no indication of how GPHIN daily reports were used, or if they even made their way into government risk assessments. Aside from funding, one of the recurring challenges faced by GPHIN has been the speed of technological change and the importance of keeping the network modern, said St. John. Throughout St. John's time in government, he said, GPHIN was on budgetary life support. \"GPHIN, although it had proved itself, was never fully financed.\" Even so, the federal government recently put out a request for help from industry to address certain functional aspects of the GPHIN system, including search and location extraction. This was its job,\" said Wesley Wark, a University of Ottawa professor.", "article_type": "politics"},
{"article_id": 21, "title": "Hubble Space Telescope celebrates 30 years in space", "author": "Nicole Mortillaro", "url": "https://www.cbc.ca/news/technology/hubble-30th-anniversary-1.5543927?cmp=rss", "summary": "While Hubble is expected to last through the 2020s, a second-generation space telescope, the James Webb Space Telescope, is scheduled to launch in 2021. However, it was first seriously considered in 1960, specifically by Nancy Grace Roman, considered the \"Mother of Hubble.\" The Hubble Space Telescope transformed the way we see the universe and our place in it, and on Friday, it celebrated 30 years in space. In 1994, Hubble turned its eye on Jupiter, for the first-ever view of a comet breaking apart and hitting a planet. While the telescope was launched in 1990, the idea of an orbiting telescope was first conceived in 1946 by Lyman Spitzer. To date, the workhorse telescope has made 1.4 million observations with data used in more than 17,000 peer-reviewed papers. But when Hubble opened its eye and took its first picture, astronomers were horrified to see a blurry and useless image.", "article_type": "technology"},
{"article_id": 22, "title": "First baby bison born on ancestral land in more than 150 years: Wanuskewin", "author": "No Author Listed", "url": "https://www.cbc.ca/news/canada/saskatoon/wanuskewin-baby-bison-1.5543754?cmp=rss", "summary": "The herd of bison reintroduced to Wanuskewin lands late last year welcomed its first newborn bison on Earth Day. The news release said the organization's elders are delighted with the birth. Wanuskewin is currently closed due to COVID-19, so visitors will need to wait until the site reopens during phase four of the Re-Open Saskatchewan strategy to see the newborn. The release said more bison births are expected this spring. The herd is a mix of genetically pure bison from the United States and from Grasslands National Park in the province's south.", "article_type": "technology"},
{"article_id": 23, "title": "Will COVID-19 change our food habits?", "author": "No Author Listed", "url": "https://www.cbc.ca/news/technology/what-on-earth-newsletter-covid-19-food-meat-1.5542706?cmp=rss", "summary": "Ratzlaff, who has \"taco night\" once or twice a week, said he's starting to research other options to get his protein, though he's not counting out meat entirely. She described the pit as an \"amazing, earth-formed natural feature,\" but acknowledged it was discovered as a result of climate change, \"which is unfortunate.\" \"It's hard to melt that much material, especially at a high elevation such as this,\" said Ward, who did not participate in the research for the paper. \"At the campsite, we saw the creek disappear at the cave site and marked its location,\" said Struik, a scientific researcher with the Geological Survey of Canada. \"Right now, my wife and I, we actually buy our fish and seafood from a [delivery] company that didn't exist two months ago,\" Charlebois said. \"Five weeks ago, walking into a grocery store, we were looking for quick fixes,\" Charlebois said. Chris Ratzlaff, a self-proclaimed meat-lover who lives in Airdrie, Alta., said the pandemic has made him rethink his meat consumption.", "article_type": "technology"},
{"article_id": 24, "title": "Congo militia ambush kills 12 park rangers who guard rare mountain gorillas", "author": "No Author Listed", "url": "https://www.cbc.ca/news/world/congo-ambush-rangers-mountain-gorillas-1.5544209?cmp=rss", "summary": "Virunga sits on the forest-covered volcanoes of Congo, also known as Congo-Kinshasa, and is home to more than half the global population of mountain gorillas. Two years ago, five of them were killed by Mai Mai militiamen, in the deadliest attack at the time. It is Africa's oldest national park and largest tropical rainforest reserve, covering 7,800 square kilometres. In May 2018, the park was closed after foreign tourists were kidnapped and their guide killed by gunmen. Many others were seriously injured, he said. It was the deadliest such attack in Virunga's recent history. Almost 200 Virunga rangers have died in past militia attacks.", "article_type": "technology"},
{"article_id": 25, "title": "1 in 10 Canadians believes a coronavirus conspiracy theory, survey suggests", "author": "Andrea Bellemare", "url": "https://www.cbc.ca/news/technology/coronavirus-conspiracy-theories-popular-canada-1.5542890?cmp=rss", "summary": "It is possible the virus could have been studied in a lab and then leaked accidentally, but it's not probable, they say. The researchers sent surveys to 600 people, half in Quebec and half in the rest of Canada, to ask about the psychological impacts of the pandemic. While just over half of those surveyed said they believe the virus occurred naturally, nearly a third said they believe it was created in a lab. One in 10 Canadians believes a conspiracy theory about the novel coronavirus, according to preliminary research from the University of Sherbrooke in Quebec. \"At least it makes you question things as opposed to [hitting] that share button without thinking,\" said Mai. The 5G conspiracy theory has gained traction this month: Google searches about 5G skyrocketed at the beginning of April, compared to the previous year. She cautioned that the findings of the study are preliminary, and that team will have the results of a survey of 1,500 Canadians two weeks from now.", "article_type": "technology"},
{"article_id": 26, "title": "Surge in demand for online shopping has Canada Post struggling to keep up", "author": "Dianne Buckner", "url": "https://www.cbc.ca/news/business/canada-post-online-shopping-retail-1.5543688?cmp=rss", "summary": "Warren Cann and his mother, Heather, have run RusTeak, a furniture store in Toronto, for 21 years, specializing in items imported from Indonesia and India as well as custom-made pieces. \"The big online retailers for sure, but also many small- and medium-sized businesses that were either selling online before, or have moved to online during the COVID crisis.\" \"For example, on Monday, April 20, we delivered more than 1.8 million parcels to Canadians. \"In March, we saw double the sales of the same period last year,\" she said. Gaelyne Leslie manufactures her skin creams, toners, lotions and lips balms in her own industrial kitchen in Toronto, but it's also under stress. Gaelyne Leslie of Toronto, founder of Crawford Street Natural Skin Care, said orders for her line of products are way up as well. \"I think condo dwellers who live in small spaces, they're going stir crazy and everyone has shifted to buying online.\"", "article_type": "technology"},
{"article_id": 27, "title": "Online sexual predators eager to take advantage of greater access to kids during COVID-19, police warn", "author": "Meagan Fitzpatrick", "url": "https://www.cbc.ca/news/canada/sexual-predators-children-online-pandemic-1.5542166?cmp=rss", "summary": "Other tips include: The RCMP is encouraging parents to \"have a sitdown chat with their kids, even if they're late teens,\" Guerin said, and talk about online safety. \"These guys are fairly dangerous in terms of their communication,\" he said, and are tech-savvy, good at manipulating young people and clever at evading law enforcement. Police in Gatineau, Que., also issued an alert on Tuesday, saying a man had contacted minors through the popular game Fortnite. \"That attitude and that position that they have, essentially, we observe as a risk towards kids.\" Police say predators are using sophisticated techniques to connect with young people wherever they can find them online, and in some cases, they impersonate a youth around the victim's age. The centre says cappers even have contests where they vote on the best \"caps,\" and there is a \"hall of fame\" on one forum. Stephen Sauer, director of the centre's tipline Cybertip.ca, said the predators educate each other on how to circumvent safety features of various apps and websites that youth use.", "article_type": "technology"},
{"article_id": 28, "title": "Concerns about low uptake, flawed pandemic data linger as provinces pursue digital contact tracing", "author": "Catharine Tunney", "url": "https://www.cbc.ca/news/politics/contact-tracing-app-provinces-1.5538541?cmp=rss", "summary": "\"Some people are just not that tech-savvy and downloading an app, setting it up, adopting whatever, it's not going to appeal to them. \"At the same time, of course, every day that goes by that we don't collect [this] information on the phones is potentially lives that we're not saving.\" At least two provinces — Ontario and British Columbia — are pursuing vendors for their own apps, said the source, while other provinces are evaluating their own solutions. Whenever you're running into a person, you will exchange anonymized Bluetooth keys and then you will know you were close to a person,\" he said. And in order to do that, we need to address the core issue of privacy,\" he said during a media briefing on Thursday. Many people don't have cell phones, including some of the people who are at most high risk for COVID-19 ... the elderly demographic,\" she added. So far, she said, the literature has suggested a contact tracing system needs a participation rate of about 60 per cent to be effective.", "article_type": "technology"},
{"article_id": 29, "title": "N.W.T. starts aerial wolf cull to preserve caribou", "author": "Avery Zingel", "url": "https://www.cbc.ca/news/canada/north/nwt-aerial-wolf-cull-starts-1.5541782?cmp=rss", "summary": "\"What we heard in the last rounds of caribou public hearings, was that given the dire situation of the caribou, we needed to do more about wolves,\" he said. Calving grounds, as \"the cradle of the nursery for caribou, should just simply be a no-go zone,\" he said. The plan was agreed upon by co-management partners, including the Tłı̨chǫ Government, as well as harvesters and residents who say management is needed to recover the herd, said Elkin. The cull is approved as a \"pilot project\" by the Wek'èezhìi Renewable Resources Board, states a March 13 letter from the board's chair, Joseph Judas, to N.W.T. \"If you're going to do wolf culls as a last resort, there needs to be appropriate habitat protections that go with it,\" he said. However, fewer wolves were harvested than expected, prompting the territorial government to use the aerial cull to meet wolf reduction targets. The board will, at a later date, review the proposed wolf management project which is proposed to run from 2021 to 2025.", "article_type": "technology"},
{"article_id": 30, "title": "Trudeau announces $1.1B scientific strategy to fight COVID-19", "author": "Kathleen Harris", "url": "https://www.cbc.ca/news/politics/trudeau-science-1.5542294?cmp=rss", "summary": "\"The better we understand this virus, its spread and its impact on different people, the better we can fight it and eventually defeat it,\" Trudeau said today. \"Testing must increase even further before we can reopen and restart our normal activities as a country,\" he said. David Naylor, who chaired the committee that reviewed Canada's response to SARS in 2003, will be on the panel. There are discussions around treatments for COVID-19 that might work as well as a vaccine,\" he said. That's why it's important to establish the capacity to mass-produce vaccines here in Canada now, he said. And this is important in guiding our recovery strategies,\" she said. Around the world, many people are losing patience with public health guidelines that compel them to stay at home and practise physical distancing.", "article_type": "technology"},
{"article_id": 31, "title": "Look out N95. A group from the U of S is engineering a new mask", "author": "Chelsea Laskowski", "url": "https://www.cbc.ca/news/canada/saskatoon/n95-alternative-mask-university-of-saskatchewan-1.5541863?cmp=rss", "summary": "And so Olson, who already had a 3D printer handy, and his colleagues — who wore masks and gloves to retrieve the university's 3D printers and take them home — got started. \"It's not really important whose design it is in the end, just that it works,\" Johnston said. For Olson, the trial and error process included the realization that the variation of people's nose shapes is the biggest challenge with mask making. Even before approval goes through, Olson said it's possible that the group will distribute masks to the general public. As for what Olson is doing with the masks he's accumulated, he's hanging onto them for now. He took inspiration from his mother's CPAP mask, which is used to help people with sleep apnea get oxygen at night. In the release, he said cloth masks may not be effective against the tiny size of the virus.", "article_type": "technology"},
{"article_id": 32, "title": "Citigroup latest major bank to end Arctic oil investment", "author": "No Author Listed", "url": "https://www.cbc.ca/news/canada/north/citigroup-bank-end-arctic-oil-investment-1.5542535?cmp=rss", "summary": "For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death. Some oil industry professionals in Alaska expressed concern that reduced financial support for Arctic drilling could threaten future projects, particularly for small oil companies with limited assets and options for generating cash. Citigroup joins Wells Fargo & Co., The Goldman Sachs Group Inc., JPMorgan Chase & Co., and Swiss bank UBS in avoiding Arctic petroleum investments. BlackRock Inc., the world's largest asset manager, urged companies in January to emphasize steps they are taking to combat global warming. For most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. \"Citi has not previously provided and will not provide project-related financing for oil and gas exploration and production in the Arctic Circle,\" the bank said. Citigroup's announcement came as the oil industry is being damaged by rapidly falling oil prices and as Alaska companies reduce spending to handle the revenue decline.", "article_type": "technology"},
{"article_id": 33, "title": "Pandemic will drive biggest drop in CO2 emissions since WW II, World Meteorological Organization says", "author": "No Author Listed", "url": "https://www.cbc.ca/news/technology/climate-emissions-wmo-1.5540721?cmp=rss", "summary": "\"We estimate that there is going to be a six per cent drop in carbon emissions this year because of the lack of emissions from transportation and industrial energy production.\" \"This crisis has had an impact on the emissions of greenhouse gases,\" WMO Secretary General Petteri Taalas told a virtual briefing in Geneva. \"We need to show the same determination and unity against climate change as against COVID-19,\" Taalas said. The statement urged governments to consider stimulus packages that helped the transition to a green economy, adding to similar calls from some governments. But the WMO warned that past economic recoveries had been associated with even higher emissions growth than before the crises.", "article_type": "technology"},
{"article_id": 34, "title": "Free online 'threat blocker' launched in Canada as successful COVID-19 scams multiply", "author": "Catharine Tunney", "url": "https://www.cbc.ca/news/politics/free-cyber-blocker-cse-1.5542888?cmp=rss", "summary": "\"Not necessarily a rise in activity, but certainly a switch to the use of COVID-related themes as lures, which are very enticing for Canadians,\" said Jones. \"The CIRA cyber shield is a new public initiative, so it certainly deserves scrutiny,\" he said. \"Basically, anything we're using to defend the government of Canada we're now making available for all Canadians, so that they can protect themselves.\" \"I don't think that it's likely that the cyber centre is, you know, going to secretly use this to build a censorship networking path. Any state-sponsored type activity as well that we can block, we're putting it in there,\" he said. As the Canadian operator of the threat-blocker, CIRA would have to comply with Canadian privacy laws, including the Personal Information Protection and Electronic Documents Act. \"If the Canadian Shield system functions properly, it could make a significant contribution to internet security while at the same time protecting privacy.\"", "article_type": "technology"},
{"article_id": 35, "title": "A computer 'the size of a credit card' could help doctors monitor COVID-19 patients remotely", "author": "No Author Listed", "url": "https://www.cbc.ca/news/canada/toronto/u-of-t-covid-19-monitoring-system-1.5540089?cmp=rss", "summary": "They attached a standard fingertip probe, already in use in hospitals to monitor vital signs, to a \"very, very small computer about the size of a credit card,\" explained Wong. \"Certainly, I'm hoping that as the word gets out here that there are more organizations that perk up and say, 'Hey, this important here,'\" said Wong. \"It's about taking these off-the-shelf components that are already designed by others and being able to put this together very, very quickly,\" Wong said. \"The solution is quite simple,\" said Professor Willy Wong, who led the project. \"The feedback that we've heard is that this is a no-brainer,\" said Wong. \"When we heard about this opportunity, we were very happy to jump into this.\" \"We can use this as a way to monitor a large group of people in these sorts of settings where they are trying to battle COVID-19.\"", "article_type": "technology"},
{"article_id": 36, "title": "Bell, TekSavvy customers shocked by price hikes during COVID-19 pandemic", "author": "Sophia Harris", "url": "https://www.cbc.ca/news/business/bell-price-increase-teksavvy-internet-covid-19-pandemic-1.5540034?cmp=rss", "summary": "That suspension, along with increased internet use by customers, forced TekSavvy to raise rates, the company said. \"It just seems to me really thoughtless,\" said Sugith Varughese of Toronto, whose internet plan with Bell went up by $6 a month on his April 6 bill. Meanwhile, because of COVID-19, Shaw has postponed planned rate hikes for internet, home phone and select TV add-on services that were set to take effect on June 1. \"They were very sympathetic, but they said, 'No, we informed you in December.' The actor, who has appeared on CBC television shows, said he hasn't worked since mid-March, when a play he was cast in got cancelled due to COVID-19. \"We had previously lowered rates and we as a company were taking monthly losses,\" said Mike Stanford, vice-president of marketing for TekSavvy. \"I was shocked,\" said Danielle ​​Tremblay, a freelance communications adviser in Ottawa who says her work dried up in late March due to COVID-19.", "article_type": "technology"},
{"article_id": 37, "title": "Scientists cut peer-review corners under pressure of COVID-19 pandemic", "author": "Bob Weber", "url": "https://www.cbc.ca/news/canada/edmonton/scientists-covid-pandemic-research-misinformation-1.5539997?cmp=rss", "summary": "\"They're not peer-reviewed,\" said Jim Woodgett, director of Toronto's Lunenfeld-Tanenbaum Research Institute, who's also affiliated with one of the main preprint sites. \"Many, many reputable journals have expedited their review process,\" Germida said. As well, most of the major journals have made their archives free and opened access, providing decades of top-quality research to whoever needs it. Increasingly, medical scientists have turned to preprint sites, where work is posted within days. LitCovid, a hub for papers on COVID-19, says more than 1,600 on the topic were published last week alone. Both the public and the reporters who write for them will have to be more careful of their sources, said Jim Germida, a University of Saskatchewan biologist. Peer review, however, takes months or even years.", "article_type": "technology"},
{"article_id": 38, "title": "Facebook wants federal court to overturn privacy commissioner's ruling on abuse of personal data", "author": "Jim Bronskill", "url": "https://www.cbc.ca/news/politics/facebook-privacy-federal-court-1.5539349?cmp=rss", "summary": "Given that the issue is before the courts, \"we are not in a position to offer comment,\" Vito Pilieci, a spokesman for the commissioner's office, said Monday. In addition, Facebook alleges the privacy watchdog's office \"did not disclose the true, sweeping scope\" of the probe until just before the 2019 report's release. Privacy commissioner Daniel Therrien's probe \"was neither impartial nor independent, and lacked procedural fairness,\" Facebook alleges in a submission to the Federal Court of Canada. It also wants an order requiring the company to implement measures to obtain, and ensure it maintains, meaningful consent from all users. There was no evidence that any Canadian's personal information had been improperly used, the notice says. Facebook wants a judge to toss out the federal privacy watchdog's finding that the social media giant's lax practices allowed personal data to be used for political purposes. \"Consequently, Facebook did not know the allegations it had to meet and was denied a fair opportunity to respond to the investigation.\"", "article_type": "technology"},
{"article_id": 39, "title": "Interstellar gatecrasher 2I/Borisov is no ordinary comet", "author": "No Author Listed", "url": "https://www.cbc.ca/news/technology/borisov-comet-1.5539309?cmp=rss", "summary": "That star may have been what is called an M-dwarf, far smaller and cooler than the sun and the smallest type of star that is known, Bodewits said. Carbon monoxide, poisonous to humans, is common as a gas in space and forms as ice only in the most frigid locations. Comets essentially are dirty snowballs composed of frozen gases, rock and dust that orbit stars. The researchers also found an abundance of hydrogen cyanide at levels similar to comets from our solar system. The only other interstellar visitor discovered in our solar system was a cigar-shaped rocky object called 'Oumuamua spotted in 2017. \"Comets are leftover building blocks from the time of planet formation.", "article_type": "technology"},
{"article_id": 40, "title": "CFL, CFLPA at impasse over contingency plan as sides grapple with unique circumstance", "author": "Dan Ralph", "url": "https://www.cbc.ca/sports/football/cfl/cfl-cflpa-dispute-1.5544489?cmp=rss", "summary": "\"I think there's nothing the players, fans and everyone involved with this league wants more [than a 2020 season],\" Ramsay said. Ramsay, the CFLPA's executive director, said the CFL can't unilaterally decide on any contingency plan as per the current collective bargaining agreement. \"That way, when we do talk we're in a position that we can play football if there's an opportunity in 2020. \"We're prepared at any time as always,\" he said. Not surprisingly, the CFL believes the clause refers to the league folding and ceasing operations, not cancelling a campaign. Any changes, he added, would require agreement from both sides. It essentially states both sides agree that if the league operation is suspended at any point, all contracts become null and void making players free agents.", "article_type": "sports"},
{"article_id": 41, "title": "Scotiabank Arena turns into giant kitchen as MLSE looks to make 10,000 meals daily", "author": "Neil Davidson", "url": "https://www.cbc.ca/news/canada/toronto/scotiabank-arena-mlse-meals-toronto-1.5543542?cmp=rss", "summary": "\"We're learning as we go,\" said Dan Morrow, MLSE's vice-president of food and beverage. \"One thing out here, you're going to find a lot of people are very passionate about their work,\" said Zielinski. For Zielinski, it's a \"little foreshadowing, for sure.\" \"This crew has just been unreal at working through all the challenges, figuring how to make the process seamless and safe,\" he added. The total number will ramp up to 90 workers, one third of whom will be chefs, when they hit high gear with 50,000 meals a week. Peeling, cutting and roasting 40 50-pound bags of carrots takes time,\" Zielinski said. Scotiabank Arena, home to the Maple Leafs and Raptors, has been turned into a giant kitchen during the COVID-19 pandemic.", "article_type": "sports"},
{"article_id": 42, "title": "Women's hockey league will only 'survive' with assist from NHL: Jayna Hefford", "author": "Vicki Hall", "url": "https://www.cbc.ca/sports/hockey/nwhl-toronto-expansion-team-official-hall-1.5541660?cmp=rss", "summary": "\"It's great there's going to be some women who can play hockey in Toronto because of this expansion,\" Jayna Hefford, the leader of the PWHPA, told CBC Sports. \"It's about infrastructure, facilities for day-time training, full-time coaching staff, insurance, and other things. There are currently teams in Boston; Monmouth Junction, N.J.; Danbury, Conn.; Buffalo, N.Y.; and Saint Paul, Minn. \"If women's pro hockey is going to happen, it's going to have to be with NHL involvement. WATCH | Mikkelson, Spooner react to Toronto addition: The NHL continues to signal its intention to support, build and back the women's game. Founded in 2015, the NWHL became North America's first pro women's league to pay its players a salary. Also missing: a commitment to play from any of the current players on the Canadian or U.S. national teams, who are members of the Professional Women's Hockey Players' Association (PWHPA).", "article_type": "sports"},
{"article_id": 43, "title": "UFC returning to competition with 3 shows in Florida", "author": "Greg Beacham", "url": "https://www.cbc.ca/sports/ufc-jacksonville-florida-may-1.5544306?cmp=rss", "summary": "However, the promotion's plans have satisfied Florida officials, including the Florida State Boxing Commission, which regulates MMA in the state. \"I can't wait to deliver some great fights for the fans,\" White said in a statement. The card also includes a heavyweight bout between contenders Francis Ngannou and Jairzinho Rozenstruik, along with a matchup of veteran contenders Anthony Pettis and Donald \"Cowboy\" Cerrone. MMA fighters traditionally don't get paid unless they compete, although Bellator and other promotions have given aid to their fighters in recent weeks after shutting down. Only \"essential personnel\" will be in the arena, according to White. The UFC is returning to competition on May 9 for three shows without fans in eight days in Jacksonville, Fla. UFC 249 will include two title fights, with bantamweight champ Henry Cejudo defending his belt against former champion Dominick Cruz.", "article_type": "sports"},
{"article_id": 44, "title": "World Triathlon Grand Final in Edmonton cancelled due to COVID-19", "author": "No Author Listed", "url": "https://www.cbc.ca/sports/olympics/summer/world-triathlon-grand-final-edmonton-cancelled-coronavirus-1.5544262?cmp=rss", "summary": "The International Triathlon Union announced the cancellation Friday, saying the global pandemic has made it impossible to stage the event. The races were originally scheduled to take place Aug. 17-23. The 2019 World Grand Final was held in Lausanne, Switzerland. Edmonton has hosted a race on the ITU World Triathlon Series circuit every year since hosting the Grand Final in 2014. The 2020 World Triathlon Grand Final in Edmonton has been cancelled due to the COVID-19 pandemic.", "article_type": "sports"},
{"article_id": 45, "title": "Miss watching sports? Cricket final going live — in Vanuatu", "author": "John Pye", "url": "https://www.cbc.ca/sports/live-sports-vanuatu-south-pacific-cricket-1.5544383?cmp=rss", "summary": "<a href=\"https://twitter.com/vanuatu_cricket?ref_src=twsrc%5Etfw\">@vanuatu_cricket</a> will be live streaming the Women's Super League Final tomorrow and a Men's T10 Exhibition match. She has represented the International Cricket Council's global development squad, and has played premier cricket for Deitz's old club the Southern Districts Stingrays in Adelaide, South Australia. Bored sports fans, he added, \"can see something a bit different. The national women's team is ranked 28th in the world, and most of the players in the squad will be involved on Saturday. We can showcase a bit of cricket for everyone who is in lock down,\" Deitz told the Associated Press. His aim is to keep developing the game and facilities, hoping to make Vanuatu a destination for club teams and national junior teams to practice and play. We can offer some entertainment — that's what we're trying to do.\"", "article_type": "sports"},
{"article_id": 46, "title": "Coronavirus: Here's what's happening in the sports world on Friday", "author": "No Author Listed", "url": "https://www.cbc.ca/sports/coronavirus-sports-april-24-1.5544451?cmp=rss", "summary": "Earlier, the X Games postponed a winter event stop in Chongli, China, scheduled for February and cancelled an installment in Shanghai in May. Rizzo said on a conference call Friday: \"I'm optimistic, as is the commissioner, that we'll have baseball in 2020. The 18th edition of the Odlum Brown VanOpen, a mixed event on the ATP Challenger Tour and the ITF World Tennis Tour, was scheduled from Aug. 16-23. Bored sports fans, he added, \"can see something a bit different. Baseball has been on hold since last month because of the coronavirus pandemic, right along with most sports and other aspects of everyday life. The International Triathlon Union announced the cancellation Friday, saying the global pandemic has made it impossible to stage the event. The latest on how the coronavirus outbreak is affecting sports around the globe: Tennis Canada announced the cancellation of three more events Friday due to the COVID-19 pandemic.", "article_type": "sports"},
{"article_id": 47, "title": "Sask. Junior Hockey League to continue coronavirus-shortened playoffs via video game simulation", "author": "Tory Gillis", "url": "https://www.cbc.ca/news/canada/saskatchewan/sjhl-virtual-playoffs-1.5541617?cmp=rss", "summary": "\"I'm sure there's going to be some chirping back and forth between the sideboards and the message boards, that are created along with the [simulation],\" said Chow. It's not pre-recorded, it's going to be on the fly,\" said Chow. That includes the players, who will be able to watch their simulated \"selves\" play, and even join in on the online message commentary. \"Out comes the virtual game, and we don't know who's going to win.\" \"It's just going to be like a normal game where they don't know what's happening the next play. The SJHL has entered individual player stats into the video game NHL 20, and is now ready to have the virtual teams face off to finish the playoffs. \"Hopefully everybody just has some fun with it, and at the end of the day a virtual Canalta Cup will be awarded.\"", "article_type": "sports"},
{"article_id": 48, "title": "'It was mandatory': Calgary Stampede cancelled for 1st time in almost a century due to pandemic", "author": "John Gibson ", "url": "https://www.cbc.ca/news/canada/calgary/calgary-stampede-covid-19-2020-announcement-1.5542680?cmp=rss", "summary": "WATCH | COVID-19 forces cancellation of Calgary Stampede: Local businesses also rely on tourism during the annual event, including restaurants, hotels, retailers and more. Last month, the Stampede announced it was laying off 80 per cent of its staff, 890 people, temporarily due to the impacts of the pandemic. \"But this year, with this risk, we simply cannot continue to do that.\" Officials in Edmonton announced Thursday that K-Days, that city's 10-day exhibition, will not take place this summer. Tom Sampson, chief of Calgary Emergency Management Agency, said these types of decisions are mandatory given the state of the pandemic in Alberta. On average over the past five years, the summer event has brought in $79.2 million in gross revenue and turned a profit of $21.4 million after expenses. \"We knew this decision went far beyond ourselves,\" Stampede president Dana Peers said.", "article_type": "sports"},
{"article_id": 49, "title": "Former tennis star sees opportunity to rebrand after Federer's idea to merge tours", "author": "No Author Listed", "url": "https://www.cbc.ca/sports/tennis/tennis-federer-tour-merge-reaction-1.5543894?cmp=rss", "summary": "\"Tennis has always been at the forefront of equality between men and women's prizemoney,\" Wilander said. \"You'll always have a number one, they come and go, but you can't lose those players down to 300. \"Some tournaments wouldn't work as men's and women's event but others would. Seven-time Grand Slam champion Mats Wilander has thrown his support behind Roger Federer's suggestion that the men's ATP Tour and women's WTA Tour could merge. Maybe we can see more men's and women's combined events so the young players can be marketed better.\" Currently TV viewers need two different pay-TV platforms to watch the men's and women's matches from the same tournament. Yes, they are obviously going to be able to practice at some point, somewhere, but not playing matches?", "article_type": "sports"},
{"article_id": 50, "title": "Bengals tap Heisman Trophy winner Joe Burrow as 1st pick of 2020 NFL Draft", "author": "Barry Wilner", "url": "https://www.cbc.ca/sports/football/nfl/2020-nfl-draft-round-one-1.5543162?cmp=rss", "summary": "WATCH | Pro sports league plot return in empty stadiums: Normalcy, at least among the picks, was the order of the early evening, though. At 6-foot-6, 236 pounds, he has the size the pros like, and he's a good athlete. They were preceded by Ohio State's Jeff Okudah, the highest-rated cornerback, to Detroit, and Georgia tackle Andrew Thomas to the Giants. First came Burrow: In his spectacular senior season, he threw for 60 — yes, 60 — touchdowns with only six interceptions. I worked really hard to get better, my guys worked really hard to get better, and we jelled as a team.\" If not for the NFL's obsession with finding the latest, greatest quarterback prospect, Young might have been the top overall selection. At 6-foot-5, 264 pounds, Young led the nation with 16 1/2 sacks and forced fumbles with six last season.", "article_type": "sports"},
{"article_id": 51, "title": "Olympians should push for collective bargaining to get fair share of money, study suggests", "author": "Eddie Pells", "url": "https://www.cbc.ca/sports/olympics/study-olympic-athletes-collective-bargaining-1.5542221?cmp=rss", "summary": "\"If the IOC is truly against the commercial abuse of athletes, it will find a way to pay its athletes back,\" the report concluded. \"It redistributes 90 per cent of all its income generated from the Olympic Games to assist athletes and develop sport worldwide,\" the IOC said. As detailed in its annual report, among the areas the IOC sends money to are international sports federations, national Olympic committees and the World Anti-Doping Agency. \"As a result, every day the IOC distributes about $3.4 million around the world to help athletes and sporting organizations.\" \"If not, it will be up to the athletes themselves.\" The IOC called the claim that it spends 4.1 per cent of of its revenue on athletes \"just plain wrong.\" Without the Olympics there would be no grand stage on which the athletes could perform.", "article_type": "sports"},
{"article_id": 52, "title": "Canadiens' Gallagher says Bettman 'very motivated' to complete NHL season", "author": "Joshua Clipperton", "url": "https://www.cbc.ca/sports/hockey/nhl/montreal-canadiens-brendan-gallagher-speaks-1.5543133?cmp=rss", "summary": "\"It always comes back to the same thing — it's about winning,\" said Gallagher, who's close with Canadiens' NHLPA representative Paul Byron. \"If it's a situation where you have a chance to play and they expand the playoff bracket, obviously, then I'd be all for it. \"If [playing this summer's] gonna interfere with our ability to prepare for [2020-21] where we have a chance, I'd rather continue my training. \"A lot of it's outside our control,\" he said. \"To me, it just really feels like Gary Bettman's going to try and do whatever he can to have hockey. Speaking on a conference call with reporters Thursday, Gallagher said NHL commissioner Gary Bettman is \"very motivated\" when it comes to completing the 2019-20 campaign. \"I will say this: I know Gary Bettman is very motivated to play these games ... so I think there's probably some form of solution to his problem.\"", "article_type": "sports"},
{"article_id": 53, "title": "NHL looking at multi-city return plan among many options for possible resumption", "author": "Myles Dichter", "url": "https://www.cbc.ca/sports/hockey/nhl/nhl-gary-bettman-sportsnet-interview-1.5541652?cmp=rss", "summary": "Bettman said the league is looking at the pause through a long-term lens, with fans, and not money, at the forefront of conversations. \"I did receive a call from NHL commissioner Gary Bettman, who wanted to ask some questions about Alberta's status and combating COVID,\" Kenney said in Edmonton on Wednesday. Bettman said the league is starting to move away from a single-city, neutral-site solution to a different format where the league would have four bubble cities with full professional facilities. Ideally, Bettman said the league would be able to complete the regular season and proceed with a normal playoff format. One issue with that plan would be that the draft is typically a busy time for player movement, but trading before the playoffs would be problematic. If the NHL is able to return from its pandemic-induced pause, Gary Bettman says it will be \"on some basis that is fair and has integrity.\" \"We're modelling, we're trying to see what our options will be under whatever scenario unfolds.", "article_type": "sports"},
{"article_id": 54, "title": "No day at the beach: Sarah Pavan awaits another shot at Olympic gold", "author": "Scott Russell", "url": "https://www.cbc.ca/sports/olympics/summer/volleyball/beach-volleyball-sarah-pavan-scott-russell-1.5541199?cmp=rss", "summary": "She's alone, isolated with her husband who's a computer programmer, and spending her days training and exercising while taking online courses in neuroscience, pharmacy, and nutrition. \"The beach is beautiful out there,\" she says, as I visualize the sand and surf at Hermosa, the beach volleyball capital of North America. Sarah Pavan is a world champion and maybe the best volleyball player this country has ever produced – indoors, outdoors, court, or beach…bar none. After the Games, Pavan and Bansley parted ways and Sarah teamed up with a new partner, Melissa Humana-Parades, a younger player from Toronto. She has played professionally in Italy, South Korea, Brazil, and China. She's the daughter of Paul and Cindy Pavan of Kitchener, Ont., who both played volleyball at Western University in London. Pavan's career, which was peaking at long last, has for now been spiked.", "article_type": "sports"},
{"article_id": 55, "title": "Former Tiger-Cats running back Dave Fleming dies at 76", "author": "No Author Listed", "url": "https://www.cbc.ca/sports/football/cfl/dave-fleming-tiger-cats-obituary-cfl-1.5543348?cmp=rss", "summary": "He's fourth in rushing touchdowns (28), fifth in overall touchdowns (50) and rushing attempts (744), sixth in rushing yards (3,398) and ninth in combined yards (7,946). \"On behalf of the Hamilton Tiger-Cats organization, I'd like to offer sincere condolences to the family and friends of Dave Fleming,\" Tiger-Cats CEO Scott Mitchell said in a release. Fleming played 130 games with the Ticats over 10 seasons from 1965 to '74 — winning league titles in '65, '67 and '72. Upon retirement from football, Fleming returned home to Pittsburgh and began a career in weightlifting. Prior to his CFL career, Fleming spent two years with the NFL's Pittsburgh Steelers. \"Dave delivered some memorable moments in our franchise's history. Fleming scored the lone touchdown in the Tiger-Cats' 13-10 Grey Cup win over the Saskatchewan Roughriders in 1972.", "article_type": "sports"},
{"article_id": 56, "title": "RJ Barrett providing 200,000 meals through Mississauga Food Bank", "author": "No Author Listed", "url": "https://www.cbc.ca/sports/basketball/nba/rj-barrett-mississauga-food-bank-1.5543089?cmp=rss", "summary": "The food bank is looking to raise $840,000 to support the community as it deals with the fallout caused by the novel coronavirus. He is averaging 14.3 points, five rebounds and 2.6 assists per game. \"One thing my family has taught me is the importance of being supportive when you can, in any way you can. It says it can provide two meals for every dollar donated. \"I'm happy I can make a difference in the neighbourhood I grew up in.\"", "article_type": "sports"},
{"article_id": 57, "title": "Canadian Duvernay-Tardif reworks contract to give NFL's Chiefs cap space", "author": "No Author Listed", "url": "https://www.cbc.ca/sports/football/nfl/nfl-laurent-duvernay-tardif-restructure-contract-1.5542562?cmp=rss", "summary": "Duvernay-Tardif, a 29-year-old native of Mont-Saint-Hilaire, Queen., signed a five-year, $42.36-million extension with the Chiefs in February 2017. Duvernay-Tardif's agent, Sasha Ghavami, confirmed the agreement in an email. \"I am very happy to have agreed to terms on a restructured contract for the 2020 season with the Kansas City Chiefs,\" Duvernay-Tardif said in a statement. The six-foot-five, 321-pound Duvernay-Tardif started all 14 regular-season games he played at right guard last season with the Chiefs. \"This allows the team to create cap space and I am very excited to be able to defend our title for the upcoming season. Duvernay-Tardif reportedly had an $8.9-million US cap hit this season before redoing his deal. The deal included $20.20 million guaranteed and a $10-million signing bonus.", "article_type": "sports"},
{"article_id": 58, "title": "Brad Treliving, fellow NHL GMs hope to learn from Thursday's remote NFL draft", "author": "Joshua Clipperton", "url": "https://www.cbc.ca/sports/hockey/nhl/nhl-general-managers-monitoring-remote-nfl-draft-1.5541252?cmp=rss", "summary": "\"I'm sure I'll keep an eye on [the NFL draft], but I don't think it's going to change much,\" he said. \"At the draft, we're around the table, everybody's on their computer, we've got the direct line to the central registry system. \"Certainly our draft is going to be remote, that would be safe to say,\" he said. Forced to suspend its season, the league last month postponed the draft and its yearly combine, which was scheduled for early June in Buffalo, N.Y. \"We can learn a lot from that -- what works, what doesn't work,\" he said. \"A lot of them do FaceTime interviews with draft prospects,\" Timmins said. \"It's going to be really interesting,\" Treliving said.", "article_type": "sports"}
]